zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133axx_ca7.h
/****************  Bit definition for GPIO_HWCFGR3 register  ****************/
#define GPIO_HWCFGR3_ODR_RES_Pos      (0U)
#define GPIO_HWCFGR3_ODR_RES_Msk      (0xFFFFUL << GPIO_HWCFGR3_ODR_RES_Pos)     /*!< 0x0000FFFF */
#define GPIO_HWCFGR3_ODR_RES          GPIO_HWCFGR3_ODR_RES_Msk                  /*!< Output data register reset value */
#define GPIO_HWCFGR3_ODR_RES_0        (0x1UL << GPIO_HWCFGR3_ODR_RES_Pos)        /*!< 0x00000001 */
#define GPIO_HWCFGR3_ODR_RES_1        (0x2UL << GPIO_HWCFGR3_ODR_RES_Pos)        /*!< 0x00000002 */
#define GPIO_HWCFGR3_ODR_RES_2        (0x4UL << GPIO_HWCFGR3_ODR_RES_Pos)        /*!< 0x00000004 */
#define GPIO_HWCFGR3_ODR_RES_3        (0x8UL << GPIO_HWCFGR3_ODR_RES_Pos)        /*!< 0x00000008 */
#define GPIO_HWCFGR3_ODR_RES_4        (0x10UL << GPIO_HWCFGR3_ODR_RES_Pos)       /*!< 0x00000010 */
#define GPIO_HWCFGR3_ODR_RES_5        (0x20UL << GPIO_HWCFGR3_ODR_RES_Pos)       /*!< 0x00000020 */
#define GPIO_HWCFGR3_ODR_RES_6        (0x40UL << GPIO_HWCFGR3_ODR_RES_Pos)       /*!< 0x00000040 */
#define GPIO_HWCFGR3_ODR_RES_7        (0x80UL << GPIO_HWCFGR3_ODR_RES_Pos)       /*!< 0x00000080 */
#define GPIO_HWCFGR3_ODR_RES_8        (0x100UL << GPIO_HWCFGR3_ODR_RES_Pos)      /*!< 0x00000100 */
#define GPIO_HWCFGR3_ODR_RES_9        (0x200UL << GPIO_HWCFGR3_ODR_RES_Pos)      /*!< 0x00000200 */
#define GPIO_HWCFGR3_ODR_RES_10       (0x400UL << GPIO_HWCFGR3_ODR_RES_Pos)      /*!< 0x00000400 */
#define GPIO_HWCFGR3_ODR_RES_11       (0x800UL << GPIO_HWCFGR3_ODR_RES_Pos)      /*!< 0x00000800 */
#define GPIO_HWCFGR3_ODR_RES_12       (0x1000UL << GPIO_HWCFGR3_ODR_RES_Pos)     /*!< 0x00001000 */
#define GPIO_HWCFGR3_ODR_RES_13       (0x2000UL << GPIO_HWCFGR3_ODR_RES_Pos)     /*!< 0x00002000 */
#define GPIO_HWCFGR3_ODR_RES_14       (0x4000UL << GPIO_HWCFGR3_ODR_RES_Pos)     /*!< 0x00004000 */
#define GPIO_HWCFGR3_ODR_RES_15       (0x8000UL << GPIO_HWCFGR3_ODR_RES_Pos)     /*!< 0x00008000 */
#define GPIO_HWCFGR3_OTYPER_RES_Pos   (16U)
#define GPIO_HWCFGR3_OTYPER_RES_Msk   (0xFFFFUL << GPIO_HWCFGR3_OTYPER_RES_Pos)  /*!< 0xFFFF0000 */
#define GPIO_HWCFGR3_OTYPER_RES       GPIO_HWCFGR3_OTYPER_RES_Msk               /*!< Output type register reset value */
#define GPIO_HWCFGR3_OTYPER_RES_0     (0x1UL << GPIO_HWCFGR3_OTYPER_RES_Pos)     /*!< 0x00010000 */
#define GPIO_HWCFGR3_OTYPER_RES_1     (0x2UL << GPIO_HWCFGR3_OTYPER_RES_Pos)     /*!< 0x00020000 */
#define GPIO_HWCFGR3_OTYPER_RES_2     (0x4UL << GPIO_HWCFGR3_OTYPER_RES_Pos)     /*!< 0x00040000 */
#define GPIO_HWCFGR3_OTYPER_RES_3     (0x8UL << GPIO_HWCFGR3_OTYPER_RES_Pos)     /*!< 0x00080000 */
#define GPIO_HWCFGR3_OTYPER_RES_4     (0x10UL << GPIO_HWCFGR3_OTYPER_RES_Pos)    /*!< 0x00100000 */
#define GPIO_HWCFGR3_OTYPER_RES_5     (0x20UL << GPIO_HWCFGR3_OTYPER_RES_Pos)    /*!< 0x00200000 */
#define GPIO_HWCFGR3_OTYPER_RES_6     (0x40UL << GPIO_HWCFGR3_OTYPER_RES_Pos)    /*!< 0x00400000 */
#define GPIO_HWCFGR3_OTYPER_RES_7     (0x80UL << GPIO_HWCFGR3_OTYPER_RES_Pos)    /*!< 0x00800000 */
#define GPIO_HWCFGR3_OTYPER_RES_8     (0x100UL << GPIO_HWCFGR3_OTYPER_RES_Pos)   /*!< 0x01000000 */
#define GPIO_HWCFGR3_OTYPER_RES_9     (0x200UL << GPIO_HWCFGR3_OTYPER_RES_Pos)   /*!< 0x02000000 */
#define GPIO_HWCFGR3_OTYPER_RES_10    (0x400UL << GPIO_HWCFGR3_OTYPER_RES_Pos)   /*!< 0x04000000 */
#define GPIO_HWCFGR3_OTYPER_RES_11    (0x800UL << GPIO_HWCFGR3_OTYPER_RES_Pos)   /*!< 0x08000000 */
#define GPIO_HWCFGR3_OTYPER_RES_12    (0x1000UL << GPIO_HWCFGR3_OTYPER_RES_Pos)  /*!< 0x10000000 */
#define GPIO_HWCFGR3_OTYPER_RES_13    (0x2000UL << GPIO_HWCFGR3_OTYPER_RES_Pos)  /*!< 0x20000000 */
#define GPIO_HWCFGR3_OTYPER_RES_14    (0x4000UL << GPIO_HWCFGR3_OTYPER_RES_Pos)  /*!< 0x40000000 */
#define GPIO_HWCFGR3_OTYPER_RES_15    (0x8000UL << GPIO_HWCFGR3_OTYPER_RES_Pos)  /*!< 0x80000000 */

/****************  Bit definition for GPIO_HWCFGR2 register  ****************/
#define GPIO_HWCFGR2_AFRL_RES_Pos     (0U)
#define GPIO_HWCFGR2_AFRL_RES_Msk     (0xFFFFFFFFUL << GPIO_HWCFGR2_AFRL_RES_Pos) /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR2_AFRL_RES         GPIO_HWCFGR2_AFRL_RES_Msk                  /*!< AF register low reset value */
#define GPIO_HWCFGR2_AFRL_RES_0       (0x1UL << GPIO_HWCFGR2_AFRL_RES_Pos)        /*!< 0x00000001 */
#define GPIO_HWCFGR2_AFRL_RES_1       (0x2UL << GPIO_HWCFGR2_AFRL_RES_Pos)        /*!< 0x00000002 */
#define GPIO_HWCFGR2_AFRL_RES_2       (0x4UL << GPIO_HWCFGR2_AFRL_RES_Pos)        /*!< 0x00000004 */
#define GPIO_HWCFGR2_AFRL_RES_3       (0x8UL << GPIO_HWCFGR2_AFRL_RES_Pos)        /*!< 0x00000008 */
#define GPIO_HWCFGR2_AFRL_RES_4       (0x10UL << GPIO_HWCFGR2_AFRL_RES_Pos)       /*!< 0x00000010 */
#define GPIO_HWCFGR2_AFRL_RES_5       (0x20UL << GPIO_HWCFGR2_AFRL_RES_Pos)       /*!< 0x00000020 */
#define GPIO_HWCFGR2_AFRL_RES_6       (0x40UL << GPIO_HWCFGR2_AFRL_RES_Pos)       /*!< 0x00000040 */
#define GPIO_HWCFGR2_AFRL_RES_7       (0x80UL << GPIO_HWCFGR2_AFRL_RES_Pos)       /*!< 0x00000080 */
#define GPIO_HWCFGR2_AFRL_RES_8       (0x100UL << GPIO_HWCFGR2_AFRL_RES_Pos)      /*!< 0x00000100 */
#define GPIO_HWCFGR2_AFRL_RES_9       (0x200UL << GPIO_HWCFGR2_AFRL_RES_Pos)      /*!< 0x00000200 */
#define GPIO_HWCFGR2_AFRL_RES_10      (0x400UL << GPIO_HWCFGR2_AFRL_RES_Pos)      /*!< 0x00000400 */
#define GPIO_HWCFGR2_AFRL_RES_11      (0x800UL << GPIO_HWCFGR2_AFRL_RES_Pos)      /*!< 0x00000800 */
#define GPIO_HWCFGR2_AFRL_RES_12      (0x1000UL << GPIO_HWCFGR2_AFRL_RES_Pos)     /*!< 0x00001000 */
#define GPIO_HWCFGR2_AFRL_RES_13      (0x2000UL << GPIO_HWCFGR2_AFRL_RES_Pos)     /*!< 0x00002000 */
#define GPIO_HWCFGR2_AFRL_RES_14      (0x4000UL << GPIO_HWCFGR2_AFRL_RES_Pos)     /*!< 0x00004000 */
#define GPIO_HWCFGR2_AFRL_RES_15      (0x8000UL << GPIO_HWCFGR2_AFRL_RES_Pos)     /*!< 0x00008000 */
#define GPIO_HWCFGR2_AFRL_RES_16      (0x10000UL << GPIO_HWCFGR2_AFRL_RES_Pos)    /*!< 0x00010000 */
#define GPIO_HWCFGR2_AFRL_RES_17      (0x20000UL << GPIO_HWCFGR2_AFRL_RES_Pos)    /*!< 0x00020000 */
#define GPIO_HWCFGR2_AFRL_RES_18      (0x40000UL << GPIO_HWCFGR2_AFRL_RES_Pos)    /*!< 0x00040000 */
#define GPIO_HWCFGR2_AFRL_RES_19      (0x80000UL << GPIO_HWCFGR2_AFRL_RES_Pos)    /*!< 0x00080000 */
#define GPIO_HWCFGR2_AFRL_RES_20      (0x100000UL << GPIO_HWCFGR2_AFRL_RES_Pos)   /*!< 0x00100000 */
#define GPIO_HWCFGR2_AFRL_RES_21      (0x200000UL << GPIO_HWCFGR2_AFRL_RES_Pos)   /*!< 0x00200000 */
#define GPIO_HWCFGR2_AFRL_RES_22      (0x400000UL << GPIO_HWCFGR2_AFRL_RES_Pos)   /*!< 0x00400000 */
#define GPIO_HWCFGR2_AFRL_RES_23      (0x800000UL << GPIO_HWCFGR2_AFRL_RES_Pos)   /*!< 0x00800000 */
#define GPIO_HWCFGR2_AFRL_RES_24      (0x1000000UL << GPIO_HWCFGR2_AFRL_RES_Pos)  /*!< 0x01000000 */
#define GPIO_HWCFGR2_AFRL_RES_25      (0x2000000UL << GPIO_HWCFGR2_AFRL_RES_Pos)  /*!< 0x02000000 */
#define GPIO_HWCFGR2_AFRL_RES_26      (0x4000000UL << GPIO_HWCFGR2_AFRL_RES_Pos)  /*!< 0x04000000 */
#define GPIO_HWCFGR2_AFRL_RES_27      (0x8000000UL << GPIO_HWCFGR2_AFRL_RES_Pos)  /*!< 0x08000000 */
#define GPIO_HWCFGR2_AFRL_RES_28      (0x10000000UL << GPIO_HWCFGR2_AFRL_RES_Pos) /*!< 0x10000000 */
#define GPIO_HWCFGR2_AFRL_RES_29      (0x20000000UL << GPIO_HWCFGR2_AFRL_RES_Pos) /*!< 0x20000000 */
#define GPIO_HWCFGR2_AFRL_RES_30      (0x40000000UL << GPIO_HWCFGR2_AFRL_RES_Pos) /*!< 0x40000000 */
#define GPIO_HWCFGR2_AFRL_RES_31      (0x80000000UL << GPIO_HWCFGR2_AFRL_RES_Pos) /*!< 0x80000000 */

/****************  Bit definition for GPIO_HWCFGR1 register  ****************/
#define GPIO_HWCFGR1_AFRH_RES_Pos     (0U)
#define GPIO_HWCFGR1_AFRH_RES_Msk     (0xFFFFFFFFUL << GPIO_HWCFGR1_AFRH_RES_Pos) /*!< 0xFFFFFFFF */
#define GPIO_HWCFGR1_AFRH_RES         GPIO_HWCFGR1_AFRH_RES_Msk                  /*!< AF register high reset value */
#define GPIO_HWCFGR1_AFRH_RES_0       (0x1UL << GPIO_HWCFGR1_AFRH_RES_Pos)        /*!< 0x00000001 */
#define GPIO_HWCFGR1_AFRH_RES_1       (0x2UL << GPIO_HWCFGR1_AFRH_RES_Pos)        /*!< 0x00000002 */
#define GPIO_HWCFGR1_AFRH_RES_2       (0x4UL << GPIO_HWCFGR1_AFRH_RES_Pos)        /*!< 0x00000004 */
#define GPIO_HWCFGR1_AFRH_RES_3       (0x8UL << GPIO_HWCFGR1_AFRH_RES_Pos)        /*!< 0x00000008 */
#define GPIO_HWCFGR1_AFRH_RES_4       (0x10UL << GPIO_HWCFGR1_AFRH_RES_Pos)       /*!< 0x00000010 */
#define GPIO_HWCFGR1_AFRH_RES_5       (0x20UL << GPIO_HWCFGR1_AFRH_RES_Pos)       /*!< 0x00000020 */
#define GPIO_HWCFGR1_AFRH_RES_6       (0x40UL << GPIO_HWCFGR1_AFRH_RES_Pos)       /*!< 0x00000040 */
#define GPIO_HWCFGR1_AFRH_RES_7       (0x80UL << GPIO_HWCFGR1_AFRH_RES_Pos)       /*!< 0x00000080 */
#define GPIO_HWCFGR1_AFRH_RES_8       (0x100UL << GPIO_HWCFGR1_AFRH_RES_Pos)      /*!< 0x00000100 */
#define GPIO_HWCFGR1_AFRH_RES_9       (0x200UL << GPIO_HWCFGR1_AFRH_RES_Pos)      /*!< 0x00000200 */
#define GPIO_HWCFGR1_AFRH_RES_10      (0x400UL << GPIO_HWCFGR1_AFRH_RES_Pos)      /*!< 0x00000400 */
#define GPIO_HWCFGR1_AFRH_RES_11      (0x800UL << GPIO_HWCFGR1_AFRH_RES_Pos)      /*!< 0x00000800 */
#define GPIO_HWCFGR1_AFRH_RES_12      (0x1000UL << GPIO_HWCFGR1_AFRH_RES_Pos)     /*!< 0x00001000 */
#define GPIO_HWCFGR1_AFRH_RES_13      (0x2000UL << GPIO_HWCFGR1_AFRH_RES_Pos)     /*!< 0x00002000 */
#define GPIO_HWCFGR1_AFRH_RES_14      (0x4000UL << GPIO_HWCFGR1_AFRH_RES_Pos)     /*!< 0x00004000 */
#define GPIO_HWCFGR1_AFRH_RES_15      (0x8000UL << GPIO_HWCFGR1_AFRH_RES_Pos)     /*!< 0x00008000 */
#define GPIO_HWCFGR1_AFRH_RES_16      (0x10000UL << GPIO_HWCFGR1_AFRH_RES_Pos)    /*!< 0x00010000 */
#define GPIO_HWCFGR1_AFRH_RES_17      (0x20000UL << GPIO_HWCFGR1_AFRH_RES_Pos)    /*!< 0x00020000 */
#define GPIO_HWCFGR1_AFRH_RES_18      (0x40000UL << GPIO_HWCFGR1_AFRH_RES_Pos)    /*!< 0x00040000 */
#define GPIO_HWCFGR1_AFRH_RES_19      (0x80000UL << GPIO_HWCFGR1_AFRH_RES_Pos)    /*!< 0x00080000 */
#define GPIO_HWCFGR1_AFRH_RES_20      (0x100000UL << GPIO_HWCFGR1_AFRH_RES_Pos)   /*!< 0x00100000 */
#define GPIO_HWCFGR1_AFRH_RES_21      (0x200000UL << GPIO_HWCFGR1_AFRH_RES_Pos)   /*!< 0x00200000 */
#define GPIO_HWCFGR1_AFRH_RES_22      (0x400000UL << GPIO_HWCFGR1_AFRH_RES_Pos)   /*!< 0x00400000 */
#define GPIO_HWCFGR1_AFRH_RES_23      (0x800000UL << GPIO_HWCFGR1_AFRH_RES_Pos)   /*!< 0x00800000 */
#define GPIO_HWCFGR1_AFRH_RES_24      (0x1000000UL << GPIO_HWCFGR1_AFRH_RES_Pos)  /*!< 0x01000000 */
#define GPIO_HWCFGR1_AFRH_RES_25      (0x2000000UL << GPIO_HWCFGR1_AFRH_RES_Pos)  /*!< 0x02000000 */
#define GPIO_HWCFGR1_AFRH_RES_26      (0x4000000UL << GPIO_HWCFGR1_AFRH_RES_Pos)  /*!< 0x04000000 */
#define GPIO_HWCFGR1_AFRH_RES_27      (0x8000000UL << GPIO_HWCFGR1_AFRH_RES_Pos)  /*!< 0x08000000 */
#define GPIO_HWCFGR1_AFRH_RES_28      (0x10000000UL << GPIO_HWCFGR1_AFRH_RES_Pos) /*!< 0x10000000 */
#define GPIO_HWCFGR1_AFRH_RES_29      (0x20000000UL << GPIO_HWCFGR1_AFRH_RES_Pos) /*!< 0x20000000 */
#define GPIO_HWCFGR1_AFRH_RES_30      (0x40000000UL << GPIO_HWCFGR1_AFRH_RES_Pos) /*!< 0x40000000 */
#define GPIO_HWCFGR1_AFRH_RES_31      (0x80000000UL << GPIO_HWCFGR1_AFRH_RES_Pos) /*!< 0x80000000 */

/****************  Bit definition for GPIO_HWCFGR0 register  ****************/
#define GPIO_HWCFGR0_OR_RES_Pos       (0U)
#define GPIO_HWCFGR0_OR_RES_Msk       (0xFFFFUL << GPIO_HWCFGR0_OR_RES_Pos)      /*!< 0x0000FFFF */
#define GPIO_HWCFGR0_OR_RES           GPIO_HWCFGR0_OR_RES_Msk                   /*!< Option register reset value */
#define GPIO_HWCFGR0_OR_RES_0         (0x1UL << GPIO_HWCFGR0_OR_RES_Pos)         /*!< 0x00000001 */
#define GPIO_HWCFGR0_OR_RES_1         (0x2UL << GPIO_HWCFGR0_OR_RES_Pos)         /*!< 0x00000002 */
#define GPIO_HWCFGR0_OR_RES_2         (0x4UL << GPIO_HWCFGR0_OR_RES_Pos)         /*!< 0x00000004 */
#define GPIO_HWCFGR0_OR_RES_3         (0x8UL << GPIO_HWCFGR0_OR_RES_Pos)         /*!< 0x00000008 */
#define GPIO_HWCFGR0_OR_RES_4         (0x10UL << GPIO_HWCFGR0_OR_RES_Pos)        /*!< 0x00000010 */
#define GPIO_HWCFGR0_OR_RES_5         (0x20UL << GPIO_HWCFGR0_OR_RES_Pos)        /*!< 0x00000020 */
#define GPIO_HWCFGR0_OR_RES_6         (0x40UL << GPIO_HWCFGR0_OR_RES_Pos)        /*!< 0x00000040 */
#define GPIO_HWCFGR0_OR_RES_7         (0x80UL << GPIO_HWCFGR0_OR_RES_Pos)        /*!< 0x00000080 */
#define GPIO_HWCFGR0_OR_RES_8         (0x100UL << GPIO_HWCFGR0_OR_RES_Pos)       /*!< 0x00000100 */
#define GPIO_HWCFGR0_OR_RES_9         (0x200UL << GPIO_HWCFGR0_OR_RES_Pos)       /*!< 0x00000200 */
#define GPIO_HWCFGR0_OR_RES_10        (0x400UL << GPIO_HWCFGR0_OR_RES_Pos)       /*!< 0x00000400 */
#define GPIO_HWCFGR0_OR_RES_11        (0x800UL << GPIO_HWCFGR0_OR_RES_Pos)       /*!< 0x00000800 */
#define GPIO_HWCFGR0_OR_RES_12        (0x1000UL << GPIO_HWCFGR0_OR_RES_Pos)      /*!< 0x00001000 */
#define GPIO_HWCFGR0_OR_RES_13        (0x2000UL << GPIO_HWCFGR0_OR_RES_Pos)      /*!< 0x00002000 */
#define GPIO_HWCFGR0_OR_RES_14        (0x4000UL << GPIO_HWCFGR0_OR_RES_Pos)      /*!< 0x00004000 */
#define GPIO_HWCFGR0_OR_RES_15        (0x8000UL << GPIO_HWCFGR0_OR_RES_Pos)      /*!< 0x00008000 */

