zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133axx_ca7.h
/***************  Bit definition for RCC_I2C12CKSELR register  ****************/
#define RCC_I2C12CKSELR_I2C12SRC_Pos               (0U)
#define RCC_I2C12CKSELR_I2C12SRC_Msk               (0x7UL << RCC_I2C12CKSELR_I2C12SRC_Pos)              /*!< 0x00000007 */
#define RCC_I2C12CKSELR_I2C12SRC                   RCC_I2C12CKSELR_I2C12SRC_Msk                        /*!< I2C1 and I2C2 kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_I2C12CKSELR_I2C12SRC_0                 (0x1UL << RCC_I2C12CKSELR_I2C12SRC_Pos)              /*!< 0x00000001 */
#define RCC_I2C12CKSELR_I2C12SRC_1                 (0x2UL << RCC_I2C12CKSELR_I2C12SRC_Pos)              /*!< 0x00000002 */
#define RCC_I2C12CKSELR_I2C12SRC_2                 (0x4UL << RCC_I2C12CKSELR_I2C12SRC_Pos)              /*!< 0x00000004 */

/***************  Bit definition for RCC_I2C345CKSELR register  ***************/
#define RCC_I2C345CKSELR_I2C3SRC_Pos               (0U)
#define RCC_I2C345CKSELR_I2C3SRC_Msk               (0x7UL << RCC_I2C345CKSELR_I2C3SRC_Pos)              /*!< 0x00000007 */
#define RCC_I2C345CKSELR_I2C3SRC                   RCC_I2C345CKSELR_I2C3SRC_Msk                        /*!< I2C3 kernel clock source selection If I2C3 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: reserved, the kernel clock is disabled */
#define RCC_I2C345CKSELR_I2C3SRC_0                 (0x1UL << RCC_I2C345CKSELR_I2C3SRC_Pos)              /*!< 0x00000001 */
#define RCC_I2C345CKSELR_I2C3SRC_1                 (0x2UL << RCC_I2C345CKSELR_I2C3SRC_Pos)              /*!< 0x00000002 */
#define RCC_I2C345CKSELR_I2C3SRC_2                 (0x4UL << RCC_I2C345CKSELR_I2C3SRC_Pos)              /*!< 0x00000004 */
#define RCC_I2C345CKSELR_I2C4SRC_Pos               (3U)
#define RCC_I2C345CKSELR_I2C4SRC_Msk               (0x7UL << RCC_I2C345CKSELR_I2C4SRC_Pos)              /*!< 0x00000038 */
#define RCC_I2C345CKSELR_I2C4SRC                   RCC_I2C345CKSELR_I2C4SRC_Msk                        /*!< I2C4 kernel clock source selection If I2C4 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: reserved, the kernel clock is disabled */
#define RCC_I2C345CKSELR_I2C4SRC_0                 (0x1UL << RCC_I2C345CKSELR_I2C4SRC_Pos)              /*!< 0x00000008 */
#define RCC_I2C345CKSELR_I2C4SRC_1                 (0x2UL << RCC_I2C345CKSELR_I2C4SRC_Pos)             /*!< 0x00000010 */
#define RCC_I2C345CKSELR_I2C4SRC_2                 (0x4UL << RCC_I2C345CKSELR_I2C4SRC_Pos)             /*!< 0x00000020 */
#define RCC_I2C345CKSELR_I2C5SRC_Pos               (6U)
#define RCC_I2C345CKSELR_I2C5SRC_Msk               (0x7UL << RCC_I2C345CKSELR_I2C5SRC_Pos)              /*!< 0x000001C0 */
#define RCC_I2C345CKSELR_I2C5SRC                   RCC_I2C345CKSELR_I2C5SRC_Msk                        /*!< I2C5 kernel clock source selection If I2C5 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: reserved, the kernel clock is disabled */
#define RCC_I2C345CKSELR_I2C5SRC_0                 (0x1UL << RCC_I2C345CKSELR_I2C5SRC_Pos)             /*!< 0x00000040 */
#define RCC_I2C345CKSELR_I2C5SRC_1                 (0x2UL << RCC_I2C345CKSELR_I2C5SRC_Pos)             /*!< 0x00000080 */
#define RCC_I2C345CKSELR_I2C5SRC_2                 (0x4UL << RCC_I2C345CKSELR_I2C5SRC_Pos)            /*!< 0x00000100 */

/***************  Bit definition for RCC_SPI2S1CKSELR register  ***************/
#define RCC_SPI2S1CKSELR_SPI1SRC_Pos               (0U)
#define RCC_SPI2S1CKSELR_SPI1SRC_Msk               (0x7UL << RCC_SPI2S1CKSELR_SPI1SRC_Pos)              /*!< 0x00000007 */
#define RCC_SPI2S1CKSELR_SPI1SRC                   RCC_SPI2S1CKSELR_SPI1SRC_Msk                        /*!< SPI/I2S1 kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_SPI2S1CKSELR_SPI1SRC_0                 (0x1UL << RCC_SPI2S1CKSELR_SPI1SRC_Pos)              /*!< 0x00000001 */
#define RCC_SPI2S1CKSELR_SPI1SRC_1                 (0x2UL << RCC_SPI2S1CKSELR_SPI1SRC_Pos)              /*!< 0x00000002 */
#define RCC_SPI2S1CKSELR_SPI1SRC_2                 (0x4UL << RCC_SPI2S1CKSELR_SPI1SRC_Pos)              /*!< 0x00000004 */

/**************  Bit definition for RCC_SPI2S23CKSELR register  ***************/
#define RCC_SPI2S23CKSELR_SPI23SRC_Pos             (0U)
#define RCC_SPI2S23CKSELR_SPI23SRC_Msk             (0x7UL << RCC_SPI2S23CKSELR_SPI23SRC_Pos)            /*!< 0x00000007 */
#define RCC_SPI2S23CKSELR_SPI23SRC                 RCC_SPI2S23CKSELR_SPI23SRC_Msk                      /*!< SPI/I2S2 and SPI/I2S3 kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_SPI2S23CKSELR_SPI23SRC_0               (0x1UL << RCC_SPI2S23CKSELR_SPI23SRC_Pos)            /*!< 0x00000001 */
#define RCC_SPI2S23CKSELR_SPI23SRC_1               (0x2UL << RCC_SPI2S23CKSELR_SPI23SRC_Pos)            /*!< 0x00000002 */
#define RCC_SPI2S23CKSELR_SPI23SRC_2               (0x4UL << RCC_SPI2S23CKSELR_SPI23SRC_Pos)            /*!< 0x00000004 */

/***************  Bit definition for RCC_SPI45CKSELR register  ****************/
#define RCC_SPI45CKSELR_SPI4SRC_Pos                (0U)
#define RCC_SPI45CKSELR_SPI4SRC_Msk                (0x7UL << RCC_SPI45CKSELR_SPI4SRC_Pos)               /*!< 0x00000007 */
#define RCC_SPI45CKSELR_SPI4SRC                    RCC_SPI45CKSELR_SPI4SRC_Msk                         /*!< SPI/I2S4 kernel clock source selection If SPI/I2S4 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: reserved, the kernel clock is disabled */
#define RCC_SPI45CKSELR_SPI4SRC_0                  (0x1UL << RCC_SPI45CKSELR_SPI4SRC_Pos)               /*!< 0x00000001 */
#define RCC_SPI45CKSELR_SPI4SRC_1                  (0x2UL << RCC_SPI45CKSELR_SPI4SRC_Pos)               /*!< 0x00000002 */
#define RCC_SPI45CKSELR_SPI4SRC_2                  (0x4UL << RCC_SPI45CKSELR_SPI4SRC_Pos)               /*!< 0x00000004 */
#define RCC_SPI45CKSELR_SPI5SRC_Pos                (3U)
#define RCC_SPI45CKSELR_SPI5SRC_Msk                (0x7UL << RCC_SPI45CKSELR_SPI5SRC_Pos)               /*!< 0x00000038 */
#define RCC_SPI45CKSELR_SPI5SRC                    RCC_SPI45CKSELR_SPI5SRC_Msk                         /*!< SPI5 kernel clock source selection If SPI5 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: reserved, the kernel clock is disabled */
#define RCC_SPI45CKSELR_SPI5SRC_0                  (0x1UL << RCC_SPI45CKSELR_SPI5SRC_Pos)               /*!< 0x00000008 */
#define RCC_SPI45CKSELR_SPI5SRC_1                  (0x2UL << RCC_SPI45CKSELR_SPI5SRC_Pos)              /*!< 0x00000010 */
#define RCC_SPI45CKSELR_SPI5SRC_2                  (0x4UL << RCC_SPI45CKSELR_SPI5SRC_Pos)              /*!< 0x00000020 */

/***************  Bit definition for RCC_UART12CKSELR register  ***************/
#define RCC_UART12CKSELR_UART1SRC_Pos              (0U)
#define RCC_UART12CKSELR_UART1SRC_Msk              (0x7UL << RCC_UART12CKSELR_UART1SRC_Pos)             /*!< 0x00000007 */
#define RCC_UART12CKSELR_UART1SRC                  RCC_UART12CKSELR_UART1SRC_Msk                       /*!< USART1 kernel clock source selection If USART1 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: reserved, the kernel clock is disabled */
#define RCC_UART12CKSELR_UART1SRC_0                (0x1UL << RCC_UART12CKSELR_UART1SRC_Pos)             /*!< 0x00000001 */
#define RCC_UART12CKSELR_UART1SRC_1                (0x2UL << RCC_UART12CKSELR_UART1SRC_Pos)             /*!< 0x00000002 */
#define RCC_UART12CKSELR_UART1SRC_2                (0x4UL << RCC_UART12CKSELR_UART1SRC_Pos)             /*!< 0x00000004 */
#define RCC_UART12CKSELR_UART2SRC_Pos              (3U)
#define RCC_UART12CKSELR_UART2SRC_Msk              (0x7UL << RCC_UART12CKSELR_UART2SRC_Pos)             /*!< 0x00000038 */
#define RCC_UART12CKSELR_UART2SRC                  RCC_UART12CKSELR_UART2SRC_Msk                       /*!< USART2 kernel clock source selection If USART2 block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. others: reserved, the kernel clock is disabled */
#define RCC_UART12CKSELR_UART2SRC_0                (0x1UL << RCC_UART12CKSELR_UART2SRC_Pos)             /*!< 0x00000008 */
#define RCC_UART12CKSELR_UART2SRC_1                (0x2UL << RCC_UART12CKSELR_UART2SRC_Pos)            /*!< 0x00000010 */
#define RCC_UART12CKSELR_UART2SRC_2                (0x4UL << RCC_UART12CKSELR_UART2SRC_Pos)            /*!< 0x00000020 */

/***************  Bit definition for RCC_UART35CKSELR register  ***************/
#define RCC_UART35CKSELR_UART35SRC_Pos             (0U)
#define RCC_UART35CKSELR_UART35SRC_Msk             (0x7UL << RCC_UART35CKSELR_UART35SRC_Pos)            /*!< 0x00000007 */
#define RCC_UART35CKSELR_UART35SRC                 RCC_UART35CKSELR_UART35SRC_Msk                      /*!< USART3 and UART5 kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_UART35CKSELR_UART35SRC_0               (0x1UL << RCC_UART35CKSELR_UART35SRC_Pos)            /*!< 0x00000001 */
#define RCC_UART35CKSELR_UART35SRC_1               (0x2UL << RCC_UART35CKSELR_UART35SRC_Pos)            /*!< 0x00000002 */
#define RCC_UART35CKSELR_UART35SRC_2               (0x4UL << RCC_UART35CKSELR_UART35SRC_Pos)            /*!< 0x00000004 */

/***************  Bit definition for RCC_UART4CKSELR register  ****************/
#define RCC_UART4CKSELR_UART4SRC_Pos               (0U)
#define RCC_UART4CKSELR_UART4SRC_Msk               (0x7UL << RCC_UART4CKSELR_UART4SRC_Pos)              /*!< 0x00000007 */
#define RCC_UART4CKSELR_UART4SRC                   RCC_UART4CKSELR_UART4SRC_Msk                        /*!< UART4 kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_UART4CKSELR_UART4SRC_0                 (0x1UL << RCC_UART4CKSELR_UART4SRC_Pos)              /*!< 0x00000001 */
#define RCC_UART4CKSELR_UART4SRC_1                 (0x2UL << RCC_UART4CKSELR_UART4SRC_Pos)              /*!< 0x00000002 */
#define RCC_UART4CKSELR_UART4SRC_2                 (0x4UL << RCC_UART4CKSELR_UART4SRC_Pos)              /*!< 0x00000004 */

/***************  Bit definition for RCC_UART6CKSELR register  ****************/
#define RCC_UART6CKSELR_UART6SRC_Pos               (0U)
#define RCC_UART6CKSELR_UART6SRC_Msk               (0x7UL << RCC_UART6CKSELR_UART6SRC_Pos)              /*!< 0x00000007 */
#define RCC_UART6CKSELR_UART6SRC                   RCC_UART6CKSELR_UART6SRC_Msk                        /*!< USART6 kernel clock source selection Written by software. others: reserved, the kernel clock is disabled */
#define RCC_UART6CKSELR_UART6SRC_0                 (0x1UL << RCC_UART6CKSELR_UART6SRC_Pos)              /*!< 0x00000001 */
#define RCC_UART6CKSELR_UART6SRC_1                 (0x2UL << RCC_UART6CKSELR_UART6SRC_Pos)              /*!< 0x00000002 */
#define RCC_UART6CKSELR_UART6SRC_2                 (0x4UL << RCC_UART6CKSELR_UART6SRC_Pos)              /*!< 0x00000004 */

