zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp133axx_ca7.h
/**************  Bit definition for RCC_MP_APB1ENCLRR register  ***************/
#define RCC_MP_APB1ENCLRR_TIM2EN_Pos               (0U)
#define RCC_MP_APB1ENCLRR_TIM2EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_TIM2EN_Pos)              /*!< 0x00000001 */
#define RCC_MP_APB1ENCLRR_TIM2EN                   RCC_MP_APB1ENCLRR_TIM2EN_Msk                        /*!< TIM2 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_TIM3EN_Pos               (1U)
#define RCC_MP_APB1ENCLRR_TIM3EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_TIM3EN_Pos)              /*!< 0x00000002 */
#define RCC_MP_APB1ENCLRR_TIM3EN                   RCC_MP_APB1ENCLRR_TIM3EN_Msk                        /*!< TIM3 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_TIM4EN_Pos               (2U)
#define RCC_MP_APB1ENCLRR_TIM4EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_TIM4EN_Pos)              /*!< 0x00000004 */
#define RCC_MP_APB1ENCLRR_TIM4EN                   RCC_MP_APB1ENCLRR_TIM4EN_Msk                        /*!< TIM4 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_TIM5EN_Pos               (3U)
#define RCC_MP_APB1ENCLRR_TIM5EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_TIM5EN_Pos)              /*!< 0x00000008 */
#define RCC_MP_APB1ENCLRR_TIM5EN                   RCC_MP_APB1ENCLRR_TIM5EN_Msk                        /*!< TIM5 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_TIM6EN_Pos               (4U)
#define RCC_MP_APB1ENCLRR_TIM6EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_TIM6EN_Pos)              /*!< 0x00000010 */
#define RCC_MP_APB1ENCLRR_TIM6EN                   RCC_MP_APB1ENCLRR_TIM6EN_Msk                        /*!< TIM6 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_TIM7EN_Pos               (5U)
#define RCC_MP_APB1ENCLRR_TIM7EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_TIM7EN_Pos)              /*!< 0x00000020 */
#define RCC_MP_APB1ENCLRR_TIM7EN                   RCC_MP_APB1ENCLRR_TIM7EN_Msk                        /*!< TIM7 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_LPTIM1EN_Pos             (9U)
#define RCC_MP_APB1ENCLRR_LPTIM1EN_Msk             (0x1UL << RCC_MP_APB1ENCLRR_LPTIM1EN_Pos)            /*!< 0x00000200 */
#define RCC_MP_APB1ENCLRR_LPTIM1EN                 RCC_MP_APB1ENCLRR_LPTIM1EN_Msk                      /*!< LPTIM1 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_SPI2EN_Pos               (11U)
#define RCC_MP_APB1ENCLRR_SPI2EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_SPI2EN_Pos)              /*!< 0x00000800 */
#define RCC_MP_APB1ENCLRR_SPI2EN                   RCC_MP_APB1ENCLRR_SPI2EN_Msk                        /*!< SPI2 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_SPI3EN_Pos               (12U)
#define RCC_MP_APB1ENCLRR_SPI3EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_SPI3EN_Pos)              /*!< 0x00001000 */
#define RCC_MP_APB1ENCLRR_SPI3EN                   RCC_MP_APB1ENCLRR_SPI3EN_Msk                        /*!< SPI3 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_USART3EN_Pos             (15U)
#define RCC_MP_APB1ENCLRR_USART3EN_Msk             (0x1UL << RCC_MP_APB1ENCLRR_USART3EN_Pos)            /*!< 0x00008000 */
#define RCC_MP_APB1ENCLRR_USART3EN                 RCC_MP_APB1ENCLRR_USART3EN_Msk                      /*!< USART3 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_UART4EN_Pos              (16U)
#define RCC_MP_APB1ENCLRR_UART4EN_Msk              (0x1UL << RCC_MP_APB1ENCLRR_UART4EN_Pos)             /*!< 0x00010000 */
#define RCC_MP_APB1ENCLRR_UART4EN                  RCC_MP_APB1ENCLRR_UART4EN_Msk                       /*!< UART4 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_UART5EN_Pos              (17U)
#define RCC_MP_APB1ENCLRR_UART5EN_Msk              (0x1UL << RCC_MP_APB1ENCLRR_UART5EN_Pos)             /*!< 0x00020000 */
#define RCC_MP_APB1ENCLRR_UART5EN                  RCC_MP_APB1ENCLRR_UART5EN_Msk                       /*!< UART5 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_UART7EN_Pos              (18U)
#define RCC_MP_APB1ENCLRR_UART7EN_Msk              (0x1UL << RCC_MP_APB1ENCLRR_UART7EN_Pos)             /*!< 0x00040000 */
#define RCC_MP_APB1ENCLRR_UART7EN                  RCC_MP_APB1ENCLRR_UART7EN_Msk                       /*!< UART7 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_UART8EN_Pos              (19U)
#define RCC_MP_APB1ENCLRR_UART8EN_Msk              (0x1UL << RCC_MP_APB1ENCLRR_UART8EN_Pos)             /*!< 0x00080000 */
#define RCC_MP_APB1ENCLRR_UART8EN                  RCC_MP_APB1ENCLRR_UART8EN_Msk                       /*!< UART8 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_I2C1EN_Pos               (21U)
#define RCC_MP_APB1ENCLRR_I2C1EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_I2C1EN_Pos)              /*!< 0x00200000 */
#define RCC_MP_APB1ENCLRR_I2C1EN                   RCC_MP_APB1ENCLRR_I2C1EN_Msk                        /*!< I2C1 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_I2C2EN_Pos               (22U)
#define RCC_MP_APB1ENCLRR_I2C2EN_Msk               (0x1UL << RCC_MP_APB1ENCLRR_I2C2EN_Pos)              /*!< 0x00400000 */
#define RCC_MP_APB1ENCLRR_I2C2EN                   RCC_MP_APB1ENCLRR_I2C2EN_Msk                        /*!< I2C2 peripheral clocks enable Cleared by software. */
#define RCC_MP_APB1ENCLRR_SPDIFEN_Pos              (26U)
#define RCC_MP_APB1ENCLRR_SPDIFEN_Msk              (0x1UL << RCC_MP_APB1ENCLRR_SPDIFEN_Pos)             /*!< 0x04000000 */
#define RCC_MP_APB1ENCLRR_SPDIFEN                  RCC_MP_APB1ENCLRR_SPDIFEN_Msk                       /*!< SPDIFRX peripheral clocks enable Cleared by software. */

/**************  Bit definition for RCC_MP_APB2ENSETR register  ***************/
#define RCC_MP_APB2ENSETR_TIM1EN_Pos               (0U)
#define RCC_MP_APB2ENSETR_TIM1EN_Msk               (0x1UL << RCC_MP_APB2ENSETR_TIM1EN_Pos)              /*!< 0x00000001 */
#define RCC_MP_APB2ENSETR_TIM1EN                   RCC_MP_APB2ENSETR_TIM1EN_Msk                        /*!< TIM1 peripheral clocks enable Set by software. */
#define RCC_MP_APB2ENSETR_TIM8EN_Pos               (1U)
#define RCC_MP_APB2ENSETR_TIM8EN_Msk               (0x1UL << RCC_MP_APB2ENSETR_TIM8EN_Pos)              /*!< 0x00000002 */
#define RCC_MP_APB2ENSETR_TIM8EN                   RCC_MP_APB2ENSETR_TIM8EN_Msk                        /*!< TIM8 peripheral clocks enable Set by software. */
#define RCC_MP_APB2ENSETR_SPI1EN_Pos               (8U)
#define RCC_MP_APB2ENSETR_SPI1EN_Msk               (0x1UL << RCC_MP_APB2ENSETR_SPI1EN_Pos)              /*!< 0x00000100 */
#define RCC_MP_APB2ENSETR_SPI1EN                   RCC_MP_APB2ENSETR_SPI1EN_Msk                        /*!< SPI/I2S1 peripheral clocks enable Set by software. */
#define RCC_MP_APB2ENSETR_USART6EN_Pos             (13U)
#define RCC_MP_APB2ENSETR_USART6EN_Msk             (0x1UL << RCC_MP_APB2ENSETR_USART6EN_Pos)            /*!< 0x00002000 */
#define RCC_MP_APB2ENSETR_USART6EN                 RCC_MP_APB2ENSETR_USART6EN_Msk                      /*!< USART6 peripheral clocks enable Set by software. */
#define RCC_MP_APB2ENSETR_SAI1EN_Pos               (16U)
#define RCC_MP_APB2ENSETR_SAI1EN_Msk               (0x1UL << RCC_MP_APB2ENSETR_SAI1EN_Pos)              /*!< 0x00010000 */
#define RCC_MP_APB2ENSETR_SAI1EN                   RCC_MP_APB2ENSETR_SAI1EN_Msk                        /*!< SAI1 peripheral clocks enable Set by software. */
#define RCC_MP_APB2ENSETR_SAI2EN_Pos               (17U)
#define RCC_MP_APB2ENSETR_SAI2EN_Msk               (0x1UL << RCC_MP_APB2ENSETR_SAI2EN_Pos)              /*!< 0x00020000 */
#define RCC_MP_APB2ENSETR_SAI2EN                   RCC_MP_APB2ENSETR_SAI2EN_Msk                        /*!< SAI2 peripheral clocks enable Set by software. */
#define RCC_MP_APB2ENSETR_DFSDMEN_Pos              (20U)
#define RCC_MP_APB2ENSETR_DFSDMEN_Msk              (0x1UL << RCC_MP_APB2ENSETR_DFSDMEN_Pos)             /*!< 0x00100000 */
#define RCC_MP_APB2ENSETR_DFSDMEN                  RCC_MP_APB2ENSETR_DFSDMEN_Msk                       /*!< DFSDM peripheral clocks enable Set by software. */
#define RCC_MP_APB2ENSETR_ADFSDMEN_Pos             (21U)
#define RCC_MP_APB2ENSETR_ADFSDMEN_Msk             (0x1UL << RCC_MP_APB2ENSETR_ADFSDMEN_Pos)            /*!< 0x00200000 */
#define RCC_MP_APB2ENSETR_ADFSDMEN                 RCC_MP_APB2ENSETR_ADFSDMEN_Msk                      /*!< Audio DFSDM peripheral clocks enable Set by software. */
#define RCC_MP_APB2ENSETR_FDCANEN_Pos              (24U)
#define RCC_MP_APB2ENSETR_FDCANEN_Msk              (0x1UL << RCC_MP_APB2ENSETR_FDCANEN_Pos)             /*!< 0x01000000 */
#define RCC_MP_APB2ENSETR_FDCANEN                  RCC_MP_APB2ENSETR_FDCANEN_Msk                       /*!< FDCAN and CANRAM peripheral clocks enable Set by software. */

